In [1]:

import pandas as pd
import numpy as np
import datetime

from pyarrow.parquet import ParquetFile
import pyarrow as pa

path = 'trx2016.parquet'

In [2]:
def read_parquet(path, engine='auto', columns=None, **kwargs):
    """
    Load a parquet object from the file path, returning a DataFrame.
    .. versionadded 0.21.0
    Parameters
    ----------
    path : string
        File path
    columns: list, default=None
        If not None, only these columns will be read from the file.
        .. versionadded 0.21.1
    engine : {'auto', 'pyarrow', 'fastparquet'}, default 'auto'
        Parquet library to use. If 'auto', then the option
        ``io.parquet.engine`` is used. The default ``io.parquet.engine``
        behavior is to try 'pyarrow', falling back to 'fastparquet' if
        'pyarrow' is unavailable.
    kwargs are passed to the engine
    Returns
    -------
    DataFrame
    """

    impl = pd.io.parquet.get_engine(engine)
    return impl.read(path, columns=columns, **kwargs)

In [3]:
abc = read_parquet(path, engine='auto', columns=['client_id','date', 'mcc_new', 'amount_sol', 'amount_usd', 'client_age', 'merchant_province', 'merchant_district'])
#age = read_parquet(path, engine='auto', columns=['id', 'client_age'])

abc.head()

,client_id,date,mcc_new,amount_sol,amount_usd,client_age,merchant_province,merchant_district
0,+cSS8MDLKuU=,2016-10-01 23:19:17-05,0,183.50,56.581491,40,,
1,+cSS8MDLKuU=,2016-10-17 23:08:58-05,0,6.15,1.896328,40,,
2,G3W6R6Q95+0=,2017-05-18 00:00:00-05,0,135.00,41.626710,72,,
3,+cSS8MDLKuU=,2017-03-06 00:23:42-05,0,32.91,10.147667,40,,
4,+cSS8MDLKuU=,2016-08-02 23:00:14-05,0,4.67,1.439976,40,,

In [4]:
len(abc)

115857449

In [5]:
abc.to_csv('trx2016_all.csv', index=False)

In [6]:
abc = abc[abc['merchant_province']=='LIMA']

In [7]:
abc.head()

,client_id,date,mcc_new,amount_sol,amount_usd,client_age,merchant_province,merchant_district
128,XxgXt1gGsxk=,2017-02-05 15:45:25-05,5541,100.0,30.83460,53,LIMA,Magdalena Del Mar
129,by4Jhi0/BVI=,2017-05-19 13:07:38-05,5541,20.0,6.16692,49,LIMA,Magdalena Del Mar
130,uY+MrfQgDFU=,2017-01-31 18:31:02-05,5541,80.0,24.66768,48,LIMA,Magdalena Del Mar
132,oTkd8whgjrI=,2016-11-07 19:26:22-05,5541,100.0,30.83460,48,LIMA,Magdalena Del Mar
133,bvbaaID5i+g=,2016-12-05 00:57:48-05,5541,20.0,6.16692,48,LIMA,Magdalena Del Mar

In [8]:
len(abc)

50233051

In [9]:
abc.to_csv('trx2016_lima.csv', index=False)

In [ ]:
#

In [10]:
pd20 = abc.groupby(['client_id']).count()[['date']]
pd20 = pd20[pd20['date']>=20]
pd20 = list(pd20.index)

              date
client_id
+++g8j9k+5A=    47
++/9crwdWSc=   125
++/NRCUAMIA=   270
++/nqADqHkE=   113
++1XMtcwMec=   135

In [18]:
abc = abc[abc['client_id'].isin(pd20)]
abc.head()

,client_id,date,mcc_new,amount_sol,amount_usd,client_age,merchant_province,merchant_district
128,XxgXt1gGsxk=,2017-02-05 15:45:25-05,5541,100.0,30.83460,53,LIMA,Magdalena Del Mar
129,by4Jhi0/BVI=,2017-05-19 13:07:38-05,5541,20.0,6.16692,49,LIMA,Magdalena Del Mar
130,uY+MrfQgDFU=,2017-01-31 18:31:02-05,5541,80.0,24.66768,48,LIMA,Magdalena Del Mar
132,oTkd8whgjrI=,2016-11-07 19:26:22-05,5541,100.0,30.83460,48,LIMA,Magdalena Del Mar
133,bvbaaID5i+g=,2016-12-05 00:57:48-05,5541,20.0,6.16692,48,LIMA,Magdalena Del Mar

In [19]:
len(abc)

45319900

In [21]:
abc.head(1000).to_csv('trx2016_lima20_head.csv', index=False)